; domain
(define (domain asparagus_serrano)
  (:requirements :strips :typing)

  (:types
    person tool material object appliance container location - object
  )

  (:predicates
    ;; 位置相关谓词
    (in ?obj - object ?cont - container)
    (at_location ?obj - object ?loc - location)

    ;; 状态相关谓词
    (clean ?t - tool)
    (oven_preheated)
    (oven_on)
    (prepared_asparagus ?a - object)
    (wrapped_asparagus ?a - object)
    (roasted_asparagus ?a - object)
    (served_asparagus ?a - object)
  )

  ;; 动作1：预热烤箱
  (:action preheat_oven
    :parameters (?oven - appliance)
    :precondition (and
      (at_location ?oven kitchen)
      (not (oven_preheated))
      (not (oven_on))
    )
    :effect (and
      (oven_on)
      (oven_preheated)
    )
  )

  ;; 动作2：添加橄榄油到烤盘
  (:action add_oil_to_tin
    :parameters (?oil - material ?tin - container)
    :precondition (and
      (in ?oil pantry)
      (at_location ?tin kitchen)
    )
    :effect (in ?oil ?tin)
  )

  ;; 动作3：准备芦笋
  (:action prepare_asparagus
    :parameters (?asparagus - object ?board - tool)
    :precondition (and
      (in ?asparagus fridge)
      (at_location ?board kitchen)
      (clean ?board)
    )
    :effect (prepared_asparagus ?asparagus)
  )

  ;; 动作4：用火腿包裹芦笋
  (:action wrap_asparagus_with_ham
    :parameters (?asparagus - object ?ham - material)
    :precondition (and
      (prepared_asparagus ?asparagus)
      (in ?ham fridge)
    )
    :effect (wrapped_asparagus ?asparagus)
  )

  ;; 动作5：将芦笋放入烤盘
  (:action place_asparagus_in_tin
    :parameters (?asparagus - object ?tin - container)
    :precondition (and
      (wrapped_asparagus ?asparagus)
      (in olive_oil1 tin1)
    )
    :effect (in ?asparagus ?tin)
  )

  ;; 动作6：将烤盘放入烤箱
  (:action put_tin_in_oven
    :parameters (?tin - container ?oven - appliance ?asparagus - object)
    :precondition (and
      (oven_preheated)
      (in ?asparagus ?tin)
    )
    :effect (in ?asparagus ?oven)
  )

  ;; 动作7：烘烤芦笋
  (:action roast_asparagus
    :parameters (?asparagus - object ?oven - appliance)
    :precondition (and
      (in ?asparagus ?oven)
      (oven_on)
      (not (roasted_asparagus ?asparagus))
    )
    :effect (roasted_asparagus ?asparagus)
  )

  ;; 动作8：上菜
  (:action serve_asparagus
    :parameters (?asparagus - object ?dish - container)
    :precondition (and
      (roasted_asparagus ?asparagus)
      (in ?asparagus tin1)
      (at_location ?dish kitchen)
    )
    :effect (and
      (in ?asparagus ?dish)
      (served_asparagus ?asparagus)
    )
  )
)

; problem
(define (problem make_asparagus_serrano)
  (:domain asparagus_serrano)

  (:objects
    ;; 人
    alice - person

    ;; 工具
    cutting_board1 - tool

    ;; 设备
    oven1 - appliance

    ;; 容器
    tin1 dish1 - container

    ;; 材料
    olive_oil1 asparagus1 serrano_ham1 - material

    ;; 位置
    kitchen pantry fridge - location
  )

  (:init
    ;; 初始位置
    (in olive_oil1 pantry)
    (in asparagus1 fridge)
    (in serrano_ham1 fridge)
    (at_location tin1 kitchen)
    (at_location dish1 kitchen)
    (at_location cutting_board1 kitchen)
    (at_location oven1 kitchen)

    ;; 工具状态
    (clean cutting_board1)

    ;; 设备状态
    (not (oven_preheated))
    (not (oven_on))

    ;; 材料未被使用
    (not (in asparagus1 tin1))
    (not (wrapped_asparagus asparagus1 serrano_ham1))
    (not (prepared_asparagus asparagus1))
    (not (roasted_asparagus asparagus1))
    (not (served_asparagus asparagus1))
  )

  (:goal (and
    (served_asparagus asparagus1)
  ))
)

; plan
1. (prepare_asparagus asparagus1 cutting_board1)
   added: (prepared_asparagus asparagus1)
   goals met: 0 of 1
2. (add_oil_to_tin olive_oil1 tin1)
   added: (in olive_oil1 tin1)
   goals met: 0 of 1
3. (wrap_asparagus_with_ham asparagus1 asparagus1)
   added: (wrapped_asparagus asparagus1)
   goals met: 0 of 1
4. (place_asparagus_in_tin asparagus1 tin1)
   added: (in asparagus1 tin1)
   goals met: 0 of 1
5. (preheat_oven oven1)
   added: (oven_on) (oven_preheated)
   goals met: 0 of 1
6. (put_tin_in_oven tin1 oven1 asparagus1)
   added: (in asparagus1 oven1)
   goals met: 0 of 1
7. (roast_asparagus asparagus1 oven1)
   added: (roasted_asparagus asparagus1)
   goals met: 0 of 1
8. (serve_asparagus asparagus1 dish1)
   added: (in asparagus1 dish1) (served_asparagus asparagus1)
   goals met: 1 of 1
